Repository: pingfangx/TranslatorX-other
Catalog: AndroidDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Then click-and-hold one of the constraint handles and drag the line to an available anchor point (the edge of another view, the edge of the layout, or a guideline).
zh_cn: 然后单击并按住一个约束控制点拖拽这条线到一个可用的锚点(其他 View、Layout 的边缘或者引导线)。

source: Then you can set up the other views to use within your new component; this is where you would create the EditText field and the PopupList.
zh_cn: 然后就可以设置在新的组件中要使用 view，这里就应该创建 EditText 和 PopupList。

source: There are a variety of ways to serve the content URI for a file to a client app.
zh_cn: 有多种方法可以将文件的 content URI 提供给客户端应用程序。

source: There are conventions for using Android's Java libraries and tools.
zh_cn: 使用 Android 的 Java 库和工具需要遵守相关规范。

source: There are currently various types of constraints that you can use:
zh_cn: 目前可以使用各种类型的约束：

source: There are definitely times when it is actually the correct thing to do, but at least you have to think about it.
zh_cn: 当然，在某些时候，空的 catch 语句确实没什么问题，但至少你得想一想。

source: There are many potential bottlenecks, but two common problems and remedies are as follows:
zh_cn: 存在许多潜在的瓶颈，但两个常见问题和补救措施如下：

source: There are many potential states that could be considered warm starts.
zh_cn: 有很多潜在的状态可以被认为是温启动。

source: There are many specialized subclasses of views that act as controls or are capable of displaying text, images, or other content.
zh_cn: 有很多专门的 view 的子类，作为控件或能显示文字、图片或其他内容。

source: There are no touch targets and this action is not an initial down so this view group continues to intercept touches.
zh_cn: 没有触摸目标，并且此操作不是初始 down，因此此 view group 继续拦截触摸。

source: There are several methods you can use to reduce the size of the Java and native codebase in your app.
zh_cn: 你可以使用多种方法来减少应用程序中 Java 和 native 代码库的大小。

source: There are standard adapters implemented for using fragments with the ViewPager, which cover the most common use cases.
zh_cn: 有一些标准的适配器实现用于与 viewpager 一起使用 fragment，这些实现涵盖了最常见的用例。

source: There are subclasses of LayoutParams for different subclasses of ViewGroup.
zh_cn: 不同的 ViewGroup 子类有不同的 LayoutParams 子类。

source: There are three important things to note in this code:
zh_cn: 此代码中有三个重要事项需要注意：

source: There are three primary ways to do this for RecyclerView.
zh_cn: RecyclerView 有三种主要方法。

source: There are two different classes of data change events, item changes and structural changes.
zh_cn: 有两类不同的数据更改事件：项更改和结构更改。

source: There are two flavors of this widget and which one is presented to the user depends on the current theme.
zh_cn: 这个小部件有两种风格，其中一种呈现给用户取决于当前主题。

source: There are two modes which determine where the FAB is shown relative to the BottomAppBar.
zh_cn: 有两种模式可确定 FAB 相对于 BottomAppBar 的显示位置。

source: There are two ways to do this:
zh_cn: 有两种方法可以做到这一点：

source: There is a form of the constructor that are called when the view is created from code and a form that is called when the view is inflated from a layout file.
zh_cn: 有一种形式的构造方法是在用代码创建 view 时被调用，另一种形式是在 view 从资源文件中加载时调用。

source: There is a limitation: because navigation controls are so important, the least user interaction will cause them to reappear immediately.
zh_cn: 有一个限制：因为导航控件如此重要，最少的用户交互也将导致它们立即重新出现。

source: There is an even easier option for creating a custom View which is useful in certain circumstances.
zh_cn: 在某些情况下，创建自定义 View 有一种更简单的选择。

source: There is an intermediate view to clip the content, setting this will have negative performance consequences.
zh_cn: 有一个剪辑内容的中间 view，设置这将产生负面的性能后果。

source: There is an optional third View element with the ID selectedIcon, which can be any View subclass (though it is typically a graphic View, such as ImageView) that can be displayed when a TwoLineListItem has focus.
zh_cn: 有一个可选的第三个 View 元素，其 ID selectedIcon，它可以是任何 View 子类(尽管它通常是图形 view，例如 ImageView)当 TwoLineListItem 具有焦点时可以显示。

source: There is no actual 'zoom' functionality handled by this widget directly.
zh_cn: 此小部件不直接处理实际的“缩放”功能。

source: There is some code that still says if (localLOGV).
zh_cn: 有些代码仍然在使用 if (localLOGV) 。

source: There must be at least 2 colors in the array.
zh_cn: 阵列中必须至少有 2 种颜色。

source: There must therefore be no active logic in an if (LOCAL_LOG) block.
zh_cn: 因此， if (LOCAL_LOG) 块中不得包含有效逻辑。

source: Therefore, action needs to be taken when serializing a CDATASection with a character encoding where some of the contained characters cannot be represented.
zh_cn: 因此，在使用字符编码序列化 CDATASection 时，需要采取措施，其中某些包含的字符无法表示。

source: Therefore, always treat acronyms as words.
zh_cn: 因此，请务必将首字母缩写词视为字词。

source: Therefore, consider using these vector graphics only when displaying small images.
zh_cn: 因此，请考虑仅在显示小图像时使用这些矢量图形。

source: Therefore, it would be wrong to write a program that depended on this exception for its correctness: ConcurrentModificationException should be used only to detect bugs.
zh_cn: 因此，为提高此类操作的正确性而编写一个依赖于此异常的程序是错误的做法，正确做法是：ConcurrentModificationException 应该仅用于检测 bug。

source: Therefore, most apps should avoid using inPurgeable to allow for a fast and fluid UI.
zh_cn: 因此，大多数应用程序应该避免使用 inPurgeable 来支持快速流畅的用户界面。

source: Therefore, the ViewStub exists in the view hierarchy until setVisibility(int) or inflate() is invoked.
zh_cn: 因此，ViewStub 存在于 view 层次结构中，直到调用 setVisibility(int) 或 inflate()。

source: These Animator-based classes change actual properties of the View object, such as alpha and translationX.
zh_cn: 基于 Animator 的类改变 View 对象的真实属性，比如 alpha 、 translationX 等。

source: These app: parameters are the custom ones that the LabelView recognizes and works with, and are defined in a styleable inner class inside of the samples R resources definition class.
zh_cn: app: 参数是 LabelView 可以识别和工作的参数，它们定义在 R 类中的 styleable 内部类。

source: These additions can quickly accumulate for complex systems or shared libraries.
zh_cn: 这些添加可以快速累积到复杂的系统或共享库。

source: These are FragmentPagerAdapter and FragmentStatePagerAdapter; each of these classes have simple code showing how to build a full user interface with them.
zh_cn: 这些是 FragmentPagerAdapter 和 FragmentStatePagerAdapter;这些类中的每一个都有简单的代码，显示如何使用它们构建完整的用户界面。

source: These are the API classes.
zh_cn: 这些是 API 类。

source: These are the API packages.
zh_cn: 这是所有的 API 包。

source: These blending modes are not defined by Porter and Duff but have been included in this class for convenience purposes.
zh_cn: 这些混合模式并未由 Porter 和 Duff 定义，但为方便起见，也包含在本类中。

source: These calls are crucial to ensure that the view behaves reliably.
zh_cn: 这些调用对于确保 view 可靠地运行至关重要。

source: These child elements all use the same attributes:
zh_cn: 这些子元素都使用相同的属性：

source: These component values should be [0..255], but there is no range check performed, so if they are out of range, the returned color is undefined.
zh_cn: 这些组件值应为[0..255]，但未执行范围检查，因此如果它们超出范围，则返回的颜色未定义。

source: These deep view hierarchies cause performance problems.
zh_cn: 这些深层 view 层次结构会导致性能问题。

source: These dimensions define how big a view wants to be within its parent (see Layout for more details.) The measured dimensions can be obtained by calling getMeasuredWidth() and getMeasuredHeight().
zh_cn: 这两个尺寸定义了一个 view 在其父 view 中想要多大，（详见 Layout）这些尺寸可能通过调用 getMeasuredWidth() 和 getMeasuredHeight() 获得。

source: These dimensions define the actual size of the view on screen, at drawing time and after layout.
zh_cn: 这对尺寸定义了 view 在发屏幕上的真实大小，在 layout 之后在绘制时。

source: These files include Java class files, resource files, and a file containing compiled resources.
zh_cn: 这些文件包括 Java 类文件，资源文件和包含已编译资源的文件。

source: These ids are typically assigned in the layout XML files, and are used to find specific views within the view tree.
zh_cn: id 通常申明在 XML 布局文件中，并用来在 view 树中查找特定的 view。

source: These interactions may include drags, swipes, flings, or any other gestures.
zh_cn: 这些交互可能包括拖动(drag)，滑动(swipe)，抛掷(fling)或任何其他手势。

source: These issues chiefly concern initializing app and activity objects, as well as the loading of screens.
zh_cn: 这些问题主要涉及初始化应用程序和 activity 对象，以及加载屏幕。

source: These methods both return the location of the view relative to its parent.
zh_cn: 这些方法都返回 view 相对于父 view 的相对位置。

source: These methods return the coordinates of the right and bottom edges of the rectangle representing the view.
zh_cn: 这些方法返回呈现 view 的矩形的右边缘和底边缘。

source: These payloads will be merged and may be passed to adapter's #onBindViewHolder(ViewHolder, int, List) if the item is already represented by a ViewHolder and it will be rebound to the same ViewHolder.
zh_cn: 这些有效载荷将被合并，如果项目已经由一个 ViewHolder 表示，则可以传递给适配器的 #onBindViewHolder(ViewHolder, int, List)，并且将重新绑定到同一个 ViewHolder。

source: These permissions are available to the client app for as long as the stack for a receiving Activity is active.
zh_cn: 只要接收 Activity 的堆栈处于活动状态，客户端应用程序就可以使用这些权限。

source: These positions include all changes until the last layout calculation.
zh_cn: 这些位置一直变化，直到最后的布局计算完成。

source: These properties are available both in the Property form as well as in similarly-named setter/getter methods (such as setAlpha(float) for ALPHA).
zh_cn: 这些属性既在 Property 表格中可用，也有相似命名的 setter/getter 方法(如 setAlpha(float) 用来设置 ALPHA)。

source: These properties can be used to set persistent state associated with these rendering-related properties on the view.
zh_cn: 这些属性可用于在 view 上设置与这些与渲染相关的属性关联的持久状态。

source: These statements apply equally to rows as well as columns, and to groups of rows or columns.
zh_cn: 这些语句同样适用于行和列，以及行或列组。

source: These tasks are:
zh_cn: 这些任务是：

source: These transient system bars will overlay app’s content, may have some degree of transparency, and will automatically hide after a short timeout.
zh_cn: 这些瞬态系统栏将覆盖应用程序的内容，可能具有一定程度的透明度，并会在短暂超时后自动隐藏。

source: These two positions are the same except the time between dispatching adapter.notify* events and calculating the updated layout.
zh_cn: 这两个位置基本是一样的，除了在分发 adapter.notify* 事件和计算更新的布局时不一样。

source: These units are relative to a 160 dpi (dots per inch) screen, on which 1dp is roughly equal to 1px.
zh_cn: 这些单位相对于 160 dpi(dots per inch 每英寸点数)的屏幕，该种屏幕 1dp 大致等于 1px。

source: These values may, but do not have to, be different from the measured width and height.
zh_cn: 这对值可能，但不必须，与测量出的宽高相同。

source: These will be set for you based on the R.attr.windowIsFloating attribute.
zh_cn: 这些将根据 R.attr.windowIsFloating 属性为你设置。

source: They allow users to enter information, select a choice, filter content, or trigger an action.
zh_cn: 它们允许用户输入信息，选择选项，过滤内容或触发操作。

source: They are distinguished by a circled icon floating above the UI and have special motion behaviors related to morphing, launching, and the transferring anchor point.
zh_cn: 它们通过浮动在 UI 上方的带圆圈的图标来区分，并且具有与变形，发射和传递锚点相关的特殊运动行为。

source: They are distinguished by an icon and a text floating above the UI and have special motion behaviors related to morphing, launching, and the transferring anchor point.
zh_cn: 它们通过在 UI 上方浮动的图标和文本来区分，并且具有与变形，发射和传递锚点相关的特殊运动行为。

source: They are most often used as a convenience to store data related to views in the views themselves rather than by putting them in a separate structure.
zh_cn: 它们通常用来方便地保存与 view 相关的参数，用它们自己保存而不是放在一个单独的结构中。

source: They only work within a ConstraintLayout.
zh_cn: 它们只在 ConstraintLayout 内工作。

source: They should be used when an application has three to five top-level destinations.
zh_cn: 当应用程序有三到五个顶级目标时，应该使用它们。

source: They thus need to correctly synchronize with any state that is also touched by the drawing thread.
zh_cn: 因此，它们需要与绘制线程也触及的任何状态正确同步。

source: They will appear at this position within the layout.
zh_cn: 它们将出现在布局中的这个位置。

source: They will be ignored because Chip manages its own start (app:chipIcon) and end (app:closeIcon) drawables.
zh_cn: 它们将被忽略，因为 Chip 管理自己的开始(app:chipIcon)和结束(app:closeIcon)drawables。

source: Think very carefully before doing this, though, and put in comments explaining why it is safe in this place.
zh_cn: 但在这样做之前，请务必三思，然后添加备注以说明为何在此处执行这类操作是安全之举。

source: This NinePatch defines one stretchable area with the left and top lines and the drawable area with the bottom and right lines.
zh_cn: 这个 NinePatch 用左边和上边的线定义了一个可拉伸的区域，用底部和右边的线定义了内容区域。

source: This View is good to be used.
zh_cn: 这个 View 可以很好地使用。

source: This ViewGroup should contain exactly one child.
zh_cn: 此 ViewGroup 应该只包含一个子项。

source: This affects the quality (color depth) as well as the ability to display transparent/translucent colors.
zh_cn: 这影响质量(颜色深度)以及显示透明/半透明颜色的能力。

source: This allows TextInputLayout to set the EditText's background to an outlined or filled box, respectively.
zh_cn: 这允许 TextInputLayout 分别将 EditText 的背景设置为轮廓或填充框。

source: This allows adding effects prior to returning a Drawable or Bitmap.
zh_cn: 这允许在返回 Drawable 或 Bitmap 之前添加效果。

source: This allows applications to present packs of actions inline with specific or repeating content.
zh_cn: 这允许应用程序以特定或重复内容显示操作包。

source: This allows it to avoid artifacts when switching in and out of that mode, at the expense that some of its user interface may be covered by screen decorations when they are shown.
zh_cn: 这允许它在切入和退出该模式时避免伪像，代价是它们的一些用户界面在屏幕装饰显示时会被屏幕装饰覆盖。

source: This allows it to avoid having to create an extra object for every entry put in to the map, and it also tries to control the growth of the size of these arrays more aggressively (since growing them only requires copying the entries in the array, not rebuilding a hash map).
zh_cn: 这允许它避免为放入映射中的每个条目创建额外的对象，并且它还尝试更积极地控制这些数组大小的增长(因为增长它们只需要复制数组中的条目，而不需要重建散列映射)。

source: This allows the pager to hold on to much less memory associated with each visited page as compared to FragmentPagerAdapter at the cost of potentially more overhead when switching between pages.
zh_cn: 与 FragmentPagerAdapter 相比，这样就可以使 pager 与每个访问页面相关联的内存占用更少，但在页面之间切换时可能会有更多的开销。

source: This allows you to watch events as they are dispatched to your children, and take ownership of the current gesture at any point.
zh_cn: 这允许你在将事件发送给 children 时观察事件，并在任何时候获取当前手势的所有权。

source: This allows your UI to continually hide the status bar, while still using the system UI flags to hide the action bar while still retaining a stable layout.
zh_cn: 这允许你的 UI 不断隐藏状态栏，同时仍然使用系统 UI 标志隐藏操作栏，同时仍保留稳定的布局。

source: This approach gives you more direct control of the list view and adapter.
zh_cn: 此方法使你可以更直接地控制列表 view 和适配器。

source: This approach is also ideal if your UI layer doesn't implement sorting, it just presents the data in the order it's given.
zh_cn: 如果你的 UI 层没有实现排序，这种方法也是理想的，它只是按照给定的顺序显示数据。

source: This approach requires that each list is represented in memory with immutable content, and relies on receiving updates as new instances of lists.
zh_cn: 这种方法要求每个列表在内存中用不可变内容表示，并依赖于接收更新作为列表的新实例。

source: This approach to going fullscreen is best used over the window flag when it is a transient state -- that is, the application does this at certain points in its user interaction where it wants to allow the user to focus on content, but not as a continuous state.
zh_cn: 使腾辉这种全屏显示方法比 window flag 更好，在窗口标记处于瞬态状态时 - 也就是说，应用程序在其用户交互中的某些点处执行此操作，以便允许用户关注内容，但不是连续状态。

source: This article describes how to reduce your app's APK size, which enables more users to download your app.
zh_cn: 本文介绍如何减少应用的 APK 大小，以便更多用户下载你的应用。

source: This attribute may not be applied if the widget is part of a chain in that dimension.
zh_cn: 如果部件是链的一部分，则属性可能不能使用。

source: This behavior has been preserved for apps that set android:targetSdkVersion="17" or older in their manifest's uses-sdk tag for compatibility.
zh_cn: 对于在其清单的 uses-sdk 标记中设置 android:targetSdkVersion="17" 或更旧版本以确保兼容性的应用，此行为已得到保留。

source: This behavior is contrasted to that of the pre-3.0 Animation-based classes, which instead animate only how the view is drawn on the display.
zh_cn: 这个行为与安卓 3.0 之前的基于 Animation 的类形成对比，之前的动画只能控制 view 在显示时的绘制。

source: This behavior is only set if the layout_behavior property is set to HideBottomViewOnScrollBehavior.
zh_cn: 仅当 layout_behavior 属性设置为 HideBottomViewOnScrollBehavior 时，才会设置此行为。

source: This button should always be used to access other navigational destinations within the container of the Toolbar and its signified content or otherwise leave the current context signified by the Toolbar.
zh_cn: 此按钮应始终用于访问工具栏容器内的其他导航目标及其指示的内容，或以其他方式保留工具栏指示的当前上下文。

source: This callback is useful when children of the item views create animations which may not be easy to implement using an ItemAnimator.
zh_cn: 当项 view 的子 view 创建的动画不容易使用 ItemAnimator 实现时，此回调非常有用。

source: This can be awkward but is still preferable to catching all Exceptions.
zh_cn: 这样做可能显得比较笨拙，但仍比捕获所有异常更可取。

source: This can be because it has fallen out of visibility or a set of cached views represented by views still attached to the parent RecyclerView.
zh_cn: 这可能是因为它已不可见，或者 view 表示的一组缓存 view 仍然附加到父 RecyclerView。

source: This can be because the intrinsic size is smaller, or its size post scaling (for density / sample size) is smaller.
zh_cn: 这可能是因为固有尺寸较小，或者其缩放后的尺寸(对于密度/样品尺寸)较小。

source: This can be changed with setMutableRequired(true).
zh_cn: 可以使用 setMutableRequired(true) 更改此设置。

source: This can be used as a reasonable signal that the view is about to be seen by the user.
zh_cn: 这可以作为用户即将看到 view 的合理信号。

source: This can be used for equality checking to find the Source which failed to completely decode.
zh_cn: 这可以用于相等性检查以找到未能完全解码的 Source。

source: This can be used to place floating views relative to other arbitrary content panes.
zh_cn: 这可用于相对于其他任意内容窗格放置浮动 view。

source: This can be used to place overlays such as buttons on top of the Surface, though note however that it can have an impact on performance since a full alpha-blended composite will be performed each time the Surface changes.
zh_cn: 这可用于在 surface 顶部放置叠加(如按钮)，但请注意，它会对性能产生影响，因为每次 Surface 更改时都会执行完整的 Alpha 混合合成。

source: This can be useful for drawing dividers between items, highlights, visual grouping boundaries and more.
zh_cn: 这可以用来绘制 item 间的分隔线，高亮，可视化分组的边界等。

source: This can be valuable in cases where an app performs lazy loading.
zh_cn: 在 app 执行延迟加载的情况下，这可能很有用。

source: This can drastically improve performance by skipping initial layout inflation or construction.
zh_cn: 复用 view 可以跳过初始化布局的加载或构造，这可以显著提高性能。

source: This can help for the purposes of animation and visual object persistence but individual item views will still need to be rebound and relaid out.
zh_cn: 这有助于实现动画和视觉对象的持久性，但仍需要重新绑定和重新关联各个项目 view。

source: This can interfere with any views which you add.
zh_cn: 这可能会干扰你添加的任何 view。

source: This can result in using a significant amount of memory since fragment instances can hold on to an arbitrary amount of state.
zh_cn: 这可能导致使用大量的内存，因为 fragment 实例可以保持任意数量的状态。

source: This changes the overlay color and elevates the card to convey motion.
zh_cn: 这会更改叠加颜色并提升卡片以传达运动。

source: This class allows you to define programmatically a set of constraints to be used with ConstraintLayout.
zh_cn: 该类允许你用代码的形式定义 ConstraintLayout 所使用的一组约束。

source: This class also defines methods for replacing matched subsequences with new strings whose contents can, if desired, be computed from the match result.
zh_cn: 此类还定义使用新字符串替换匹配子序列的方法，需要时，可以从匹配结果计算出新字符串的内容。

source: This class also defines the ViewGroup.LayoutParams class which serves as the base class for layouts parameters.
zh_cn: 此类还定义 ViewGroup.LayoutParams 类，该类用作布局参数的基类。

source: This class also handles saving and restoring of fragment's state.
zh_cn: 该类也处理 fragment 状态的保存和恢复。

source: This class can be implemented easily by apps using a RelativeLayout or a LinearLayout.
zh_cn: 应用程序可以使用 RelativeLayout 或 LinearLayout 轻松实现此类。

source: This class contains the different attributes specifying how a view want to be laid out inside a ConstraintLayout.
zh_cn: 该类包含了不同的属性，以指明一个 view 想要如何在 ConstraintLayout 内布置。

source: This class controls the visibility of a set of referenced widgets.
zh_cn: 此类控制一组引用的小部件的可见性。

source: This class defines the animations that take place on items as changes are made to the adapter.
zh_cn: 该类定义了发生在 item 上的动画，当适配器发生改变时。

source: This class encapsulates scrolling with the ability to overshoot the bounds of a scrolling operation.
zh_cn: 此类封装了滚动功能，可以超出滚动操作的范围。

source: This class encapsulates scrolling.
zh_cn: 该类封装滚动。

source: This class holds the current attribute values for a particular theme.
zh_cn: 此类包含特定主题的当前属性值。

source: This class is a calendar widget for displaying and selecting dates.
zh_cn: 此类是用于显示和选择日期的日历小部件。

source: This class is a drop-in replacement for Scroller in most cases.
zh_cn: 在大多数情况下，此类是 Scroller 的替代品。

source: This class is deprecated because this is just a convenient UI widget class that application developers can re-implement on top of existing public APIs.
zh_cn: 不推荐使用此类，因为这只是一个方便的 UI 窗口小部件类，应用程序开发人员可以在现有的公共 API 之上重新实现它。

source: This class is deprecated.
zh_cn: 此类已弃用。

source: This class is not supported anymore.
zh_cn: 此类不再受支持。

source: This class is used to create a multiple-exclusion scope for a set of radio buttons.
zh_cn: 此类用于为一组单选按钮创建一个相互排除的区域。

source: This class offers automatic animation between updates, and will try recycling old views for each incoming RemoteViews.
zh_cn: 此类在更新之间提供自动动画，并将尝试为每个传入的 RemoteViews 回收旧 view。

source: This class represents a delegate that can be registered in a View to enhance accessibility support via composition rather via inheritance.
zh_cn: 此类表示可以在 View 中注册的委托，以通过组合而不是通过继承来增强可访问性支持。

source: This class represents the basic building block for user interface components.
zh_cn: 该类展示了构建用户界面组件的基础。

source: This class should be used if you need to support shadows on pre-L devices.
zh_cn: 如果你需要支持 pre-L 设备上的阴影，则应使用此类。

source: This class supplies Material styles for the card in the constructor.
zh_cn: 此类在构造函数中为卡提供材质样式。

source: This class supplies updated Material styles for the button in the constructor.
zh_cn: 此类为构造函数中的按钮提供更新的材质样式。

source: This class uses attributes from the Material Theme to style a CheckBox.
zh_cn: 此类使用“材质主题”中的属性来设置 CheckBox 的样式。

source: This class uses attributes from the Material Theme to style a RadioButton.
zh_cn: 此类使用“材质主题”中的属性来设置 RadioButton 的样式。

source: This class uses attributes from the Material Theme to style a Switch.
zh_cn: 此类使用“材质主题”中的属性来设置 Switch 的样式。

source: This class was deprecated in API level 16.
zh_cn: 此类在 API 级别 16 中已弃用。

source: This class was deprecated in API level 21.
zh_cn: 此类在 API 级别 21 中已弃用。

source: This class was deprecated in API level 23.
zh_cn: 此类在 API 级别 23 中已弃用。

source: This class was deprecated in API level 3.
zh_cn: 此类在 API 级别 3 中已弃用。

source: This code declares two custom attributes, showText and labelPosition, that belong to a styleable entity named PieChart.
zh_cn: 此代码声明了两个自定义属性 showText 和 labelPosition，它们属于名为 PieChart 的 styleable 实体。

source: This code sample demonstrates how to modify the contents of the text view defined in the previous XML layout:
zh_cn: 此代码示例演示如何修改先前 XML 布局中定义的文本 view 的内容：

source: This configuration can produce slight visual artifacts depending on the configuration of the source.
zh_cn: 根据源的配置，此配置可能会产生轻微的视觉瑕疵。

source: This configuration may be useful when using opaque bitmaps that do not require high color fidelity.
zh_cn: 使用不需要高色彩保真度的不透明位图时，此配置可能很有用。

source: This constant is deprecated.
zh_cn: 该常量已被弃用。

source: This constant was deprecated in API level 15.
zh_cn: 该常量在 API 级别 15 中已弃用。

source: This constant was deprecated in API level 21.
zh_cn: 该常量在 API 级别 21 中已弃用。

source: This constant was deprecated in API level 28.
zh_cn: 该常量在 API 级别 28 中已弃用。

source: This constructor allows the layout editor to create and edit an instance of your view.
zh_cn: 此构造函数允许布局编辑器创建和编辑 view 的实例。

source: This content includes language strings and styles, as well as paths to content that is not included directly in the resources.arsc file, such as layout files and images.
zh_cn: 此内容包括语言字符串和样式，以及未直接包含在 resources.arsc 文件中的内容路径，例如布局文件和图像。

source: This demonstrates many aspects of using the Android platform, among them is extending an EditText View to make a lined notepad.
zh_cn: 这个示例演示了很多使用 Android 平台的方面，范例中继承了 EditText 来创建一个 lined notepad。

source: This description will be used for accessibility or other similar descriptions of the UI.
zh_cn: 该描述将用于 UI 的可访问性或其他类似描述。
